{"podcast_details": {"podcast_title": "After Hours", "episode_title": "Going out with a bang: Recommendations for this summer", "episode_image": "https://f.prxu.org/415/images/396792c6-2fd8-4cd5-afc9-3b5a87fdb8a2/TAC_AfterHours.png", "episode_transcript": " Ted Audio Collective. Hello everyone, you're listening to After Hours. I'm Felix. I'm Mihihr. And I'm Young Mi. Hi guys. Young Mi Moon. She is back. This is the last big episode before the summer break so I thought I've got to sneak my way in here before the summer arrives. It's so good to see you guys. It's so great to see you and no mega recommendation episode would be complete without Young Mi Moon. Oh well thank you for saying that. How have you guys been? Have you been doing well? Yeah really well. So excited for the summer. Oh. Even just thinking about this episode all the things I could do. I need an eight month summer. I have to ask you since it's been so long since I've seen the two of you, what is the biggest way in which you've changed since we've last done the podcast together? You mean other than I shaved for the special occasion? You do look good. There have been some radical things. I know. Just buckle up. I went from 12, 8, 5. It's actually like an 11, 7, 6. Oh my god. That is really radical. 12 was the hours between eating. That's gone down to 11. Yeah it's bad. And then number hours of sleep is more like 7 but the miles are 6. Wait. That's walking right? Yeah. So how long does it take you to walk six miles? It's right around two hours. It's 20 minutes a mile. But you multitask right? Yeah. I mean you're doing phone calls and you're doing a bunch of stuff. So it's great. Anyway I think I'm gonna converge on like 999 at some point. Who knows? Well you look fantastic. So clearly it's working and honestly eight hours was always too much sleep. It's just too unrealistic I think. So but what about you Felix? As both of you know I'm new to gardening. Yes. And in the beginning it was so much fun, so much joy. But also I was so anxious about every little plant. And now I've come to realize you know things live, things die. When something dies, something else will grow. Wow. It's even more joyful without the anxiety. That's great. That is probably a healthier way to approach it right? Yes. Because it's a little bit more relaxed and a little bit more of a lifestyle as opposed to a second job. I had no idea there was so much wisdom in gardening. That's fantastic. I tell you half the internet is just advice and gardening. And Young-Me, what about you? Well you missed the month where I went dry completely, successfully by the way. Which was amazing. Good for you. I'm sort of glad I missed that. Yes it's good you missed it. I was cranky at first. And then more broadly the biggest lifestyle change is I told you one of my kids has gone vegan and I had not gone vegan but my meat consumption has pretty radically declined. And as a result I'm even more into really flavorful spicy foods. Because when you're eating a lot of plants you want them to be very very flavorful. Yeah and I have something for both of you which is since Felix mentioned it as a trend and Young-Me, you like this. My youngest daughter has just gone all-in on Korean food. She's gone bonkers. Every opportunity she gets she's all over it. It's been wonderful. But fantastic for you guys too because I mean who doesn't want Korean food. It's really a Korean moment no? It is exactly. You called it. It's Korean culture and food and movies and books and everything. It's penetrating the 12 year old market as well I can just assure you of that. Although I think black pink had something to do with it too by the way. Well and BTS but you know growing up as a Korean American you always felt a little bit of an inferiority complex relative to other Asian cultures. And to have this moment right now it's like finally people are paying attention. It's really quite satisfying. So I brought in a lot of recommendations guys. So did we. So I think we better get started. Okay. All right. So Mi-Hye-Ri what did you bring? God so much. How about should we start with watching stuff? Because I'm kind of excited about watching some stuff. Yes. Finally I saw Tar the movie. Have you guys seen this? I have. Oh my god. It is so crazy. That's a good word. I watched it again and I'm still confused about it. I don't even know how I feel about it. I'm not recommending it as like the greatest movie ever. I've got to hear that. Yeah me too. But it is so thought-provoking. I know it stirred a lot of controversy. I was uncomfortable the entire time I watched it. Yeah. I don't know that I enjoyed it. I agree with everything you said though. It is thought-provoking. It's disturbing. But I don't know that I would recommend it because I was so uncomfortable watching it. Felix I'm looking at your face too. Oh I really disliked it. Oh really? I thought there was a bunch of cliches. It was boring. It should have been an hour shorter than it was. Wow. I could not find into that movie. I was so puzzled by it. Interesting. I feel like I should mount a defense. Although the good news is if you're a listener you can actually make your own decision having heard these opposing views. But first off, Cate Blanchett is stunningly good. I love everything she's in and I thought she acted amazingly. I also just thought as a movie about art and about creativity and about hero worship, I don't know. I just thought it was beautiful. And here's my slightly less controversial watching suggestion which is Tehran which is on Apple TV. So good. The Mossad is operating inside Tehran and it's crazy. And the second season had Glenn Close and the third season which is going to come out is going to have Hugh Laurie. And it's all shot in Athens because they didn't actually shoot in Tehran. Are these long seasons? No, they're like eight episodes each. I love that. I think six to eight is perfect. Six to eight and takes place in a really interesting scenario. I don't know, just a lovely. So Tar and Tehran are my two things to watch for the summer. Since I haven't been on the podcast, I went through a whole bunch of things I've watched. I'm sure you've mentioned some of these. So I thought about Succession and Barry. There's a show called Jury Duty which is hilarious. And so I thought about all of these shows. By the way, did you notice how I snuck all of those things in and out? Very elegant. Instead I have two recommendations that are both somewhat different. The first is a somewhat quieter show. It's called Somebody Somewhere and it's on HBO. That was one of my recommendations. Oh, really? Oh, so let's talk about it together. So I'll describe it and then Felix, you jump in. So it stars Bridget Everett who is spectacular. What a force. As someone who has to return to her hometown in Kansas to take care of her sister and then tries to build a life in this hometown she grew up in after her sister passes away. And it's a show about so many things that could come across much more aggressively and much more harshly. It's a show about dislocation. It's a show about the clash between progressive and conservative culture. But instead of it feeling harsh and angry, it is so warm and it is filled with so much humanity. It's subversive but in the most gentle way. I find the show to be so soothing. This was the perfect description. In a way, it could have turned demoralizing so easily. The main character is stuck geographically, is stuck career-wise, is stuck not really knowing what to do with life and how to achieve some modest amount of happiness. And when you think about all of these things, you think, oh my god, this is going to be horrible to watch. And I think so much of it is due to Bridget Everett's acting, which is just spectacular. She's so good. She's so good, so human. And very often the camera is on her. She doesn't speak at all. And you just see an entire story, how her mood changes, how she swings from one emotion to the next and all without dialogue. It's fantastic. And then Jeff Hiller, who's the other person who also somehow doesn't really fit in, but he's much better at dealing with it. They went to high school together, but she doesn't remember him. And then his first response is, yeah, of course, no one ever remembers me. They take out the yearbook. In fact, they find him. They were in the same year, but he is so joyful, so upbeat, and then also fragile at one and the same time that you really fear for him and his happiness. It's brilliant. It's really fantastic. Are we selling it, Mihir? You're selling it really well. I was so happy to see that it got renewed for our third season. Mihir, you have to check it out. I hadn't even heard of it. And then I have something very different. It's a documentary called Ascension on Paramount Plus. Have you guys heard of this? It's this incredible documentary by Jessica Kingdon. There's no narration. There's no narrative. It's just a series of video vignettes with natural sound from different slices of life in China. So you see everything from Chinese social influencers. You look inside factories and vacation spots and restaurants. It is such a sweeping look at the breadth of the Chinese economy. I found it to be utterly hypnotic. So is there a narration? None, nothing. It's just video after video, yet it's absorbing and it provides such a contrast to more reductive characterizations of China. I found it to be so rich and so textured. It takes you into a class where women are trying to learn business etiquette so they can engage in business with Westerners. It takes you into a factory where they're creating the most realistic sex dolls you could even imagine. It takes you behind the scenes of Chinese social influencers while they are pushing product at an astronomical rate. I mean, it's just one vignette after another. You should check it out. It's called Ascension by Jessica Kingdon. That sounds great. Really wonderful. Wow. Felix, what do you have? In addition to Somebody Somewhere, I have an episode of the Ezra Klein podcast, which I find generally just really amazing. The guests he has, the way he interacts with guests, it's really quite remarkable. But one of my favorite episodes is one with Farid Zakaria. They talk geopolitics, as you might imagine. The first part of the episode is about Ukraine and Russia. It's maybe sort of what you would expect. It's not that remarkable. But then almost the entire second half of the show is about China. They disagree on everything, but they disagree in the smartest, most respectful way you can possibly imagine. I have not heard a conversation about China as smart as that conversation. Wow. So they talk a little bit about Huawei. One argument is, well, this is just putting China down because Huawei didn't do anything wrong. Then there's a very smart counter. Or they talk about the chips war. They come out looking at the issue in completely different ways. What's so fascinating about the conversation is you find yourself nodding for 30 minutes. You agree with the first set of arguments. You agree with the second set of arguments, just because it's smart. It's so different from 99% of what we hear about China at this moment in time. He is very good. I agree with you that he's a very good podcast host. Yeah. All right. So, Youngmi, what do you have? Should we do books next? Yeah. Let's do books. Please. This is so hard because I've read so many good books. So I boiled it down to four and then I boiled it down to three. And I'll do them very, very quickly. So the first one I decided to talk about was a book called Trust by Herman Diaz. That was going to be one of mine. Oh my God. You go and then I'll join in. Okay. So just one, the Pulitzer. It's a book that reads like a literary puzzle. And by that, I mean it has four parts. Each part is very different. And because I had read very little about the book when I picked it up, it actually took me a while to figure out what the four parts had to do with each other. Right. And as you start to figure it out, it all starts to make sense. The book takes place in the 1920s and 30s. So the roaring 20s, the great depression. And if you ask me what it's about, it's about money. It's about status. It's about gender. It's about class. The title is a bit of a play on words. It's called Trust. So that refers to trust as the financial instrument, a trust, but also trust and betrayal. Like who can you trust? How much can you even trust what you're reading? Can you even trust the author of this thing that you're reading right now? It plays mind games with you as you're reading it. It's not only very clever in its construction. It's so absorbing. I think you're exactly right. And I would just add one thing about it, which is it's just really hard to write great fiction about business and finance. And this is great, great fiction about all the things you said, but it's centered on these issues of money. Part of the reason I was drawn to it and I wanted to recommend it is for folks who are interested in thinking about business and society, but also how it gets portrayed. I can't think of a better effort to really fictionalize what capitalism is about and the role of money in our lives. It's just fantastic. And the stories we tell ourselves about money and how we end up creating these icons in our mind and these great figures of business and how that happens and how much truth there is to that and how much of that is fiction really stays with you. Exactly. So that was my first. My second is a book called Evicted by Matthew Desmond, who's a sociologist. This book too won the Pulitzer. It's an ethnography of these eight families in Milwaukee as they try to prevent from being evicted. And it's an astonishing book as a work of sociology. It's amazing. Yeah. And you will never think about home ownership or having a roof over your head in the same way again, after you read this book, because it takes you through this cycle of eviction and unemployment and then having your children fall behind in their schooling and how all of these things are connected and so many of the absurd contradictions within our housing and rental markets and how that can cascade into every aspect of our lives. It was so compelling. And then the last one is a book called Impossible Owls by Brian Phillips. This is some of the best essay writing I've read in such a long time. I fell in love with this guy. It's quirky. It's strange. It's eclectic. It's absolutely wonderful. It's one of those books where every essay, you're just savoring every sentence, every paragraph. Loved it. Impossible Owls, Brian Phillips. Wow. I love essays. Essays are such a great form and it's hard to find people who do it well. That sounds terrific. And it's like a snack, like right before you go to bed to just read one. It's self-contained. It's so perfect. Fantastic. So Felix, what do you have? The first one that I wanted to recommend is by Greg Golding and Sam Lubell, Never Build New York. And it's a book about architectural plans by famous architects, by architects you have never heard of that wanted to build particular projects in New York. And it takes you through the stories why these things in the end weren't built. So it's a confluence, sometimes taste, sometimes local opposition. Sometimes you wanted to build a really big office tower and then guess what? The market for offices was relatively weak and so they scrapped it. And it does two things really beautifully. The first is I like to look at architectural drawings and I like to look at models that they build. It's beautiful. It's as much looking as reading. But also you think the built environment is sort of what it is. And you walk away with a sense that, oh my God, the city could have looked so different. It could have done very different things. Over the course of the 20th century, there were so many ideas around more communal forms of living that came very close to being implemented. And then the mayor changes or there's a crisis or the architectural firm gets into trouble. And you walk away with a sense of the fluidity of the urban landscape and how close we came to creating a city that would have felt quite different than many dimensions. So I really love that book. They did one for LA first. I have never looked at the one for LA, but I'm guessing that's equally interesting. But Felix, are these like coffee table books? Yes. It's sort of coffee table plus because it takes you into the stories, what exactly happened, who was in favor, who was against. So it gives you the stories why things were not built. I love it. The second recommendation that I have is the Atlantic magazine does something, which I find actually quite interesting. They pick old articles that they send out by email that in their view at least stood the test of time, contribute to something that we're thinking about at this moment. And so it was literally the same day that I picked up a book about family and family forms. And then I saw in my email, this much shorter article by David Brooks titled, The Nuclear Family Was a Mistake. And Brooks talks about the history of the nuclear family and in particular about all the things that are correlated with current issues. One devastating statistic that I had no idea of, 15% of kids before they're 20, they have multiple changes in parents because of divorce, because of people finding new partners. And it was sort of an interesting coincidence because I had just started reading this book by Kristin Gottsy called Everyday Utopia in Praise of Radical Alternatives to the Traditional Family Home. And there you get an even bigger sense that the nuclear family, the way we celebrate it, it's such a historical aberration. Basically it hasn't existed in US history, but it exists nowhere else. Totally. Other than in Western countries for really historically speaking, just a little while. Yeah. There was this blip in the 50s and 60s when it seemed to work. And then I think we have now seen all these pretty dramatic downsides to living isolated, living in small groups as opposed to the more communal living. And she makes the good point that we still have it in parts. So when you go to college, well, that's basically very communal and often until you can afford your own apartment, you have roommates. And then when you're old, a typical form is much more communal living. But at the time when people have, say, young kids and really urgently need all their housing, all the help they can possibly get, that's exactly the time when we sort of engineer the form of loneliness. That is great. I love this because as my children get further into adulthood, I'm constantly looking for excuses to move in with them. So this is the perfect excuse. And particularly if they ever have kids, you want to keep that extended family together and all the relatives and cousins and everybody under the same roof. Yeah. And also thinking beyond kinship. So for instance, platonic parenting, where two people get together to raise a child and it's not related to romantic love or kinship at all. So I have not really thought about just how uncommon it is what I have taken for granted for a long time. Right. I love when these things that you just completely take for granted as being the norm, all of a sudden you realize no, it's not. And historically, especially Felix, as you point out, it's a complete aberration. Yeah. Both those things sound fantastic. Mihir, did you have another book in addition to The Trust? My other recommendation is a nonfiction piece called An Immense World by Ed Yong. He has written this book, which is all about sensory perception, but it's largely about animals and how they perceive the world. In particular, animals have various ways to perceive the world that we don't have. So think about a bat who uses sonar. He goes through this litany of the ways in which animals experience the environment. And in that process, he makes you understand that what you experience in the world is just some small fraction of what there is to be experienced. Yeah. Wow. And even this kind of sense of five senses, which we've lived with for two to 3000 years, it's just not true. There are actually many more senses. There are senses that are kind of mixes of other different kinds of senses. And then these animals have different other kinds of senses. So in this process of opening up the animal world, which is kind of fantastic, just in its own, right? To appreciate animals and what they are able to experience that we're not. He makes you appreciate the natural world all the more, because you come to realize you're getting some tiny little sliver of what is actually going on in the world. The other nice thing about it is he writes in a way that I find quite inspiring. Actually, he takes the reader along and he's explaining very complex stuff sometimes, but you feel like he's your companion. He's kind of holding your hand through some pretty complex material. And he does it in this really skillful way, because that can become so trite and so old. And he's just always uncovering mysteries. And he's like, I know what you're thinking about and you're thinking it's confusing. I know what you're thinking. It's confusing. And let me tell you why it's okay. It was just fantastic. So An Immense World by Ed Yong is a great nonfiction read for the summer. Let's take a break. I mean, I haven't done this in a long time. I need a break. Welcome to the window, the window of opportunity when your next move can either make your business famous or obsolete. So you need to be ready. Be good surprises and bad surprises ready. The opening of Portland, Houston and Providence location on the same day ready. The stock options plus paid family leave ready. SAP has been there and can help you be ready for anything that happens next. Because it will. Be ready with SAP. Visit sap.com slash be ready. Felix, another recommendation. What do you have? Oh, I'm moving on to culinary issues. So one of the great joys for me, even just when I think about summer, I love any anise based drink. Pastis in France, Ouzo in Greece, Rake in Turkey, sitting outside, a summer experience, you're relaxed. I love that moment when the drink goes from clear to cloudy. When you add water. If you have a chance this summer, to me, it's the perfect summer drink. Oh, I like it. It's also a great after dinner thing. Exactly. A nice digestive. For those who don't drink alcohol, just any seeds are used in India as an after dinner kind of mint. And they are also fantastic. Anise is just a great flavor profile. Yeah. Love it. What do you have for us, young me? I have become obsessed with Patagonia's tinned fish. One of you guys, Mahir, was that you that recommended that? Yes. So can I re-recommend that? Because- Please do. First of all, I do think the number of varieties has increased. They've really expanded their portfolio of tinned fish. They have different flavored anchovies and mackerel and salmon and mussels. And you can do so many things with them. Sandwiches, salads, appetizers. I recommend eating them with something pickled. It could be pickled onions or pickled cucumbers and some lemon, something acidic. What else can you eat out of a can and yet feel classy? Exactly. You're living large. You are living large. The other part that I really love about this story is when we teach corporate strategy, we often talk about how a capability that you have inside your organization might lend itself to very different businesses that don't look that related at first glance. We don't really have a ton of fabulous examples, but I've always loved the fact how you went from fleece to tinned fish and essentially built on a very particular capability having to do with quality control in your supply chain, where it turns out the kinds of things that matter for the production of their core products are exactly the kinds of things that you would pay a lot of attention to if you were to serve food. And so also the little corporate nerd in me just thinks like, oh my God, this is one of the more ingenious and fun examples. Mihir, what food thing are you obsessed with lately? Well, I'm going to be a little bit on Felix's line, which is a drink. I think I've recommended drinks before like Chandies and dirty martinis. And I think this summer, I'm going to go a little more lower brow, but it's just a great drink in a particular version that I've had at Momofuku, which is this great chain in New York. It is spicy margaritas. Oh, I love those. Spicy margaritas and they're really amped up. So the one you get at Momofuku hits you nice and hard. Man, on a hot day, having a spicy with full pieces of jalapeno, they use a fair amount of very concentrated peppers and slice them up like five chili peppers in each drink. Man, that will just wake you up. And then the flavor profile is amazing. So spicy margaritas. There is nothing that gets your appetite going. If you sit down at a table and you drink something that has that sweet, sour, spicy to it with all that acid, your appetite is ready to go. I mean, it's really nice. I agree with you. That's a good one. Yeah. Fantastic. So nobody actually, well, you came close to Junk Meat Up actually providing a food recommendation. Yes. Felix and I. Exactly. Exactly. Yeah. Exactly. More drinks. I do have a food recommendation that's current. We're in the middle of rhubarb season. So I don't know if the two of you eat rhubarb. Love. Rhubarb pies. I don't. I like the dessert version of rhubarb, but it's just amazing. Yeah. Really good. So if you have a chance, tarts, pies, rhubarb season's upon us. That's great. So I don't know how to eat rhubarb. I would need some suggestions on what to do with rhubarb. Very common is rhubarb tarts. People often make jam out of rhubarb also. And you will like this. When I grew up, we ate rhubarb on toasted bread with whipped cream, toast, rhubarb, whipped cream, lots of sugar. Oh my God. I'm in heaven. That is great. Okay. So I'll put on my list. I'll try rhubarb this summer. Perfect. Okay. I have another recommendation of something to do this summer. I think this is a sign that I'm getting old because I remember when I was young and I would be in a park or something and I would look at bird watchers, I would just think, oh my God, how boring. What an incredibly boring thing to do. And now I'll walk through a park and I'll stop my husband and say, wait, is that a black cap chickadee? So bird watching is something that I'm beginning to dabble with. And in my particular case, a little bit of technology has really pushed me along. I got a bird feeder called the Bird Buddy and it's incredible. It's a bird buddy that you put in your backyard and it connects to your wifi and it's got a really good camera in it. And whenever a bird comes and lands and eats, it begins to take video and photos and it uses artificial intelligence to identify the type of bird it is. And you get a little ping, an alert on your phone and you open up your phone and you've got this bird looking right at you, eating your bird seed and it's identified what the bird is. And the first time it happens, it's thrilling. It's like collecting Pokemon. You're collecting all the different birds that have come to your bird feeder. And then the cool thing is, is you can follow other people who have bird buddies around the world. There are people in Australia and people in Asia, they have these bird buddies and you can see the different types of birds that are landing on their bird feeders and you can build your collection that way. That's amazing. And sometimes you can see a little drama. I had this chickadee that was eating some bird seed and then another one landed right next to it. And then the first one kind of fought it off a little bit. And so there was a little bit of a tussle. Nice. So it's very dramatic. So that's my recommendation. Part of why I love the story Young Me is you know how in many ways, and maybe this is when you're young, you feel sort of you're different, you're special, you can't really imagine doing things that many other and in particular older people do. And then there's this perfectly predictable trajectory. So cliche. I know I've turned into a cliche. That basically goes from not really paying attention to nature. And I had to laugh because I wanted to recommend Planet Net app, which is a plant recognition app, which turns out to be a much more difficult AI problem than animals. In part because you can't see the whole plant very often and many leaves look quite similar. If you use say Google image recognition or any one of these services, they're mostly getting it wrong. What's really nice about Planet Net app is exactly this communal aspect that you described for the birds. People take pictures of their plants and people compare it and there's endless conversations. Is it a weed? Is it not a weed? Is it a real plant? Could it survive? Maybe it's an annual, who knows? So I think our trajectories have a certain common experience. It's not looking good Felix for us. You have to hold down the cool factor because Felix and I have gone full blown. We're just aging by the day. Well, I appreciate both of your recommendations. And I have to say Young Me, I've fallen for the bird thing a little bit too. There's been like these owls that have been tracking in the city and it's just been really fun to be a part of that and watch some of that. But if you are out walking around and doing some of these things, my recommendation is for you, which is, this is a little bit of a recommendation and a mea culpa. So the recommendation is I went to buy new sneakers and I went to a store called Fleet Feet and they did a scan of my foot. So first off, these foot scans are fantastic. And then second, I realized I was wearing the wrong size shoe. I was like a full size off. And so my recommendation is first, take care of your feet and go get a foot scan. And like think about whether you're wearing... Young Me, you might remember the last time we were together, I was down on chunky sneakers. You were, yes. And I just mea culpa. I was wrong. See, I told you. I just want to come clean. I bought a pair of these New Balance Mores, which are a foam sneaker. It's even bigger than some of the Hoka's. Well, they're more. They're more, indeed. And let me tell you, fantastic. I was just wrong, wrong, wrong. You feel super human in them. You feel fantastic. Anyway, so just take care of your feet, consider like buying a bigger shoe and think about the chunky sneakers, which I just did in an earlier podcast. I'm totally reversing myself. You sound fantastic. If this was network TV, we will now have five ads and some medication that helps you maintain memory. Have you fallen down and you need to get up? Oh my God. Okay. I have another recommendation for things to do. In the past year, I've spent a lot of time in Asia. One of my favorite things when I'm in Korea or Japan or Singapore or wherever, is to visit the night markets. I had always sort of assumed it was one of those things that I can only do when I travel. But someone clued me in recently that in New York City, in the summer, there are a number of places where you can go and they have these night markets. And I have never been and I'm going to try them out. So apparently Brooklyn has a night market. Queens has one. Harlem. Apparently Manhattan Central Park in the summer, there's a new vegan night market that they are going to be doing this summer. So I would absolutely recommend that people check these things out because the more people go, the more likely they are to sustain themselves and do them on a regular basis. But it is one of the things I'm looking forward to doing this summer. I too associated them with Asia. Yeah. I mean, you're too busy chasing owls and identifying plants. What other recommendations do you have? So I wanted to recommend a product actually. Okay. Do you guys use laundry strips? Strips? It's essentially a sheet of paper that replaces the laundry detergent that you would normally use. And it's amazing. I have to say the cleanliness of clothes is probably the same as your general laundry detergent, but it does away with so many problems. So for instance, there's no plastic. You don't lug around these big jugs of laundry detergent. If you compare it to pots, laundry pots that are popular, they have the problem that often microplastics don't completely dissolve in the water. It's just such a brilliant idea, so much better for the environment without any loss in the quality of the laundry. Felix, I'm just looking at it online. It doesn't look like any of the larger detergent companies have caught on. I don't actually know. It's a great question to ask. I've never really looked at whether larger companies are making them. They look so good. It's one of these ideas where you look at it and you go, why did it take so long for us to figure out that you could do laundry that way? I am familiar with the tablets. And is it completely dissolved away or what comes out? Yeah, completely dissolves away. It's a little bit what you use in the tumbler. Remember we had these tumbler sheets, but they're a little more rigid. Nice, Felix. That's a great recommendation. And you said you had two? Oh, yes, I have. See that? Your memory. I don't know if you guys ever look at recipes online. I often do. I have a particular set of ingredients in the fridge and I think, oh, what could I make with this? Well, let the internet help me. And I have to say, looking at recipes online is always mildly irritating in part because these web pages are so long. There's a long introduction, then there's the 15 steps to boiling water. Totally. I hate it. And then half an hour later, you find the list of ingredients and then much, much later, basically the steps how you make it. So copy me that is amazing. So you open the app, there's a built-in browser. As if you were to search the web, you see some web page. And then if the recipe looks good, you click copy me that. And then all it attracts is a picture, the list of ingredients and the steps how to make it. Everything else gets stripped out. You can add it to your collection of recipes. I've never had an experience where it extracted something that I didn't want that wasn't part of the recipe or where it imported a paragraph that was not necessary. It's really good at recognizing the structure of recipes and then just distilling the essentials. So copy me that is really amazing. That's fantastic. That is so good. So there's this lovely website called Reasons to Be Cheerful that has been pioneered by David Byrne, who at least I know Felix, you really like and I love. And this and this website is just fantastic. So it's exactly what you would think it is, which is Reasons to Be Cheerful. And it has stories that are really truly inspiring. I'm just going to read you a couple of the headlines that are up right now, because it'll give you a flavor for what it is. Woodworking and hugs inside the mental health movement for men. Nerf guns and Einstein role play. How Australia is amping up science education. The Portland art of feel good densification. Japan's newest vending machines are stocked for disaster relief. It's just filled with weird little ideas that are making the world a little bit better. And I have to say, I think I once have recommended kotki.org. This is even better, just a website filled with these wonderful little ideas. And it's kind of got that David Byrne imprint on it too, which I'm all for, but just a lovely website with tons of interesting content. It's refreshes pretty frequently and it's always written really thoughtfully and stuff you haven't heard of. At least I haven't heard of. And it sounds like the topics can be quite serious. So it's not only progress on something funny or something that made you smile. Oh, yeah. Yeah. Yeah. Oh, wonderful. What an antidote to all the other news. Indeed. Okay. I have one more that you're not allowed to make fun of me. That means we're totally going to make fun of her feelings. No, it's an app for people who spend a lot of time thinking about UFOs. The app is called Enigma. As you know, there have been hundreds of thousands of so-called sightings of UFOs. And some of them have even been recorded by video or by fighter jets, some murky video where you see a little dot flying in the sky. Wouldn't it be amazing if there was an app that had all of that stuff against a map of the world so you could see where it was spotted and when it was spotted with all the dates and who spotted it and whether it was verified or not. Nice. All the data associated with any sighting along with how credible the sighting was and all of that. And then combine it with the ability to upload anything you capture on your own smartphone. And you can say, I was in my backyard and I saw this thing and I pulled my phone out and here it is. And it looked like this and this is how it behaved and this is what I captured. This is the app that does that. And it was just released and it's called Enigma apps. And when you open it up, you get a globe and you can see all the sightings from your area and what date they happened. You can look at historical sightings. I started playing with this app and I got completely lost in the app. And what's cool about it is that this is like an early, early beta version of the app. They're working with the military, for example, to upload all of their sightings. The military's released a whole bunch of information about this. And so here I can see you smiling over there. So am I crazy? This kind of interesting note. So do you believe in UFOs? Well, a UFO is simply an unidentified flying object. So yes, I'm open-minded about all of this stuff. I am too. I'm open-minded too. With everything else, I'm super curious. Here's what's really interesting because I've been thinking a lot about this. The military industrial complex, as it were, for decades has tried to convince us that UFOs didn't exist. And any kind of speculation about it was absolute nonsense. And I think what's really interesting is it feels like in the last 12 months, the stance on that has changed. Either they have decided that they want Americans to believe there's something there or they actually believe there's something there. I'm not sure which is true, but it's incredible how much they're releasing and how openly they're talking about it. And it's almost like they want to get it on our radar. They want us talking about it. And I'm not sure why that is. What's changed? If they want to distract us from everything else they're doing or whether or not they truly believe it. I have no idea. I didn't put this first on my list of things to talk about in this podcast, but it's a nice one to put at the end. Yeah. Very nice. So that last day of summer, you ran out of all ideas what to do, what to look at. It's like in an act of desperation, you might fire up Enigma. Exactly. Enigma. Good. I think it's totally reasonable, Youngmeat. I guess the way I feel about this is I think almost all supposed sightings are not, but you can still be very much open to the possibility. That's how I feel about it. For example, I look at some of this stuff on this app and I think, oh, come on, that's a weather balloon or oh, please. And almost all this stuff. But does that mean I'm not still curious? It's a distraction and it's fun. That's a good summer distraction. Exactly. So that was fun guys. Yeah. So good to have you. Thanks for having me back. One final recommendation. I think Youngmeat should come back more often. Well, are you guys going to start up again in the fall, I imagine? Yes. So this is our very last episode of the season and we'll be back sometime in September, but at this time it'll be a little quiet around after hours. And we can't end the season without thanking the man who makes it all happen, Peter Linnae. Peter Linnae. Our wonderful sound engineer. Thank you, Peter. And we're really just grateful to him, of course, but also to all of the folks who listen to the podcast and who make this so much fun for all of us. Thanks everyone. Have a great summer. This was it for tonight. You were listening to After Hours from the TED Audio Collector. Thanks for watching. Sometimes work can get a little chaotic. With Asana, everything falls into place. It's easy to coordinate tasks across teams and see what everyone's working on. So every team can stay on track without all the emails and meetings and everything is right where it should be. Try it for free at asana.com. That's A-S-A-N-A dot com."}, "podcast_summary": "In this podcast episode, Felix, Mihe, and Young Mi discuss their personal changes since they last recorded the podcast together. They talk about their sleep and eating habits, as well as their interests in gardening, Korean food, and dry periods without alcohol. They then move on to recommend various forms of media, including movies such as \"Tar\" and TV shows like \"Tehran\" and \"Somebody Somewhere.\" They also share book recommendations like \"Trust\" by Herman Diaz, \"Evicted\" by Matthew Desmond, and \"Impossible Owls\" by Brian Phillips. Additionally, they suggest trying out Patagonia's tinned fish, drinking anise-based drinks, and enjoying rhubarb during the summer season. Other recommendations include trying out Birdwatching, visiting night markets in various locations, using laundry strips, using the Copy Me That app for managing and organizing recipes, and exploring the Enigma app for UFO sightings. The episode concludes with a thank you to their sound engineer, Peter Linnaeus, and their listeners, and an announcement about the podcast returning in the fall.", "podcast_guest": "Ezra Klein", "podcast_highlights": "Here are some highlights from the podcast transcript:\n\n- Young Mi Moon returns for the last big episode before the summer break.\n- Young Mi and Felix discuss the ways they have changed since their last podcast together, including Young Mi's reduced eating and sleeping schedule and Felix's newfound love for gardening.\n- They discuss their favorite TV shows and movies, including the thought-provoking movie \"Tar\" and the TV series \"Tehran\" and \"Somebody Somewhere.\"\n- They recommend books such as \"Trust\" by Herman Diaz, \"Evicted\" by Matthew Desmond, and \"Impossible Owls\" by Brian Phillips.\n- The hosts share their favorite culinary recommendations, including Patagonia's tinned fish and spicy margaritas.\n- They discuss the joys of bird-watching and visiting night markets, and Young Mi recommends the Enigma app for UFO enthusiasts."}